TASK-1 Pratice Question

1. Create 3 list viz. productId, Product Name, Product Price with 5 elements each.

In [1]:
import pandas as pd

In [2]:
data = [[123,'Soap',50],
        [456,'Towel',500],
       [789,'Body Wash',800],
       [147,'Shampo',750],
       [258,'Face Wash',350]]
df = pd.DataFrame(data,columns=['ProductId','Product Name','Product Price'])
df

   ProductId Product Name  Product Price
0        123         Soap             50
1        456        Towel            500
2        789    Body Wash            800
3        147       Shampo            750
4        258    Face Wash            350

2. Extract one by one column and display separately from above dataframe.

In [3]:
df['ProductId']

0    123
1    456
2    789
3    147
4    258
Name: ProductId, dtype: int64

In [4]:
df['Product Name']

0         Soap
1        Towel
2    Body Wash
3       Shampo
4    Face Wash
Name: Product Name, dtype: object

In [5]:
df['Product Price']

0     50
1    500
2    800
3    750
4    350
Name: Product Price, dtype: int64

In [6]:
df.loc[0]

ProductId         123
Product Name     Soap
Product Price      50
Name: 0, dtype: object

In [7]:
df.loc[1]

ProductId          456
Product Name     Towel
Product Price      500
Name: 1, dtype: object

In [8]:
df.loc[2]

ProductId              789
Product Name     Body Wash
Product Price          800
Name: 2, dtype: object

In [9]:
df.loc[3]

ProductId           147
Product Name     Shampo
Product Price       750
Name: 3, dtype: object

In [10]:
df.loc[4]

ProductId              258
Product Name     Face Wash
Product Price          350
Name: 4, dtype: object

3. Display separately each and every row from an above dataframe. (use loc or iloc function)

In [12]:
df.loc[0]

ProductId         123
Product Name     Soap
Product Price      50
Name: 0, dtype: object

In [13]:
df.loc[1]

ProductId          456
Product Name     Towel
Product Price      500
Name: 1, dtype: object

In [14]:
df.loc[2]

ProductId              789
Product Name     Body Wash
Product Price          800
Name: 2, dtype: object

In [15]:
df.loc[3]

ProductId           147
Product Name     Shampo
Product Price       750
Name: 3, dtype: object

In [16]:
df.loc[4]

ProductId              258
Product Name     Face Wash
Product Price          350
Name: 4, dtype: object

4. Display product name from 3 row using loc function.

In [17]:
df['Product Name'].loc[[0,1,2]]

0         Soap
1        Towel
2    Body Wash
Name: Product Name, dtype: object

5. Display price located in 2 row using iloc function.

In [18]:
df['Product Price'].iloc[1]

500

6. Display 2nd to 4th row data excluding price

In [20]:
df[['ProductId','Product Name']].loc[2:4]

   ProductId Product Name
2        789    Body Wash
3        147       Shampo
4        258    Face Wash

7. Display 1 to 3rd row price data only.

In [21]:
df['Product Price'].loc[1:3]

1    500
2    800
3    750
Name: Product Price, dtype: int64

8. Change marks in python column to 41 for students who have scored less than 40.

In [26]:
data = [["Dev",50,56,89,40,50,85],
       ["Mahek",84,75,64,58,74,62],
       ["Diya",55,65,74,80,52,40],
       ["Suraj",12,52,34,15,69,55],
       ["Harsh",25,40,33,10,25,60]]
pf = pd.DataFrame(data, columns=["Student Name","Maths","English","Science","Gujarati","Hindi","Sanskrit"])
pf

  Student Name  Maths  English  Science  Gujarati  Hindi  Sanskrit
0          Dev     50       56       89        40     50        85
1        Mahek     84       75       64        58     74        62
2         Diya     55       65       74        80     52        40
3        Suraj     12       52       34        15     69        55
4        Harsh     25       40       33        10     25        60

In [27]:
marks=pf['Maths']<40
pf.loc[marks,'Maths']=45
pf

  Student Name  Maths  English  Science  Gujarati  Hindi  Sanskrit
0          Dev     50       56       89        40     50        85
1        Mahek     84       75       64        58     74        62
2         Diya     55       65       74        80     52        40
3        Suraj     45       52       34        15     69        55
4        Harsh     45       40       33        10     25        60

9. Add 2 marks to all the subjects marks. If any of the marks exceeds 100 change it to 100

In [33]:
data = [[50,56,89,40,50,85],
       [84,75,64,58,74,62],
       [55,65,74,80,52,40],
       [12,52,34,15,69,55],
       [25,40,33,10,25,60]]
columns=["Data Science","OOAD","python","Maths","Java","Statistics"]
index = ["Dev","Mahek","Diya","Suraj","Harsh"]
df = pd.DataFrame(data, columns=columns, index=index)
def add_marks(row):
    return min(100, row + 2)
df = df.applymap(add_marks)
df

       Data Science  OOAD  python  Maths  Java  Statistics
Dev              52    58      91     42    52          87
Mahek            86    77      66     60    76          64
Diya             57    67      76     82    54          42
Suraj            14    54      36     17    71          57
Harsh            27    42      35     12    27          62

10. Display students who have scored more than 50 marks in python and more than 60 marks in data science

In [35]:
df[(df['python']>50) | (df['Data Science']>60)]

       Data Science  OOAD  python  Maths  Java  Statistics
Dev              52    58      91     42    52          87
Mahek            86    77      66     60    76          64
Diya             57    67      76     82    54          42

11. Display students records whose name starts with letter S

In [36]:
df[df.index.str.startswith('S')]

       Data Science  OOAD  python  Maths  Java  Statistics
Suraj            14    54      36     17    71          57

12. Display students records whose name ends with letter a.

In [37]:
df[df.index.str.endswith('a')]

      Data Science  OOAD  python  Maths  Java  Statistics
Diya            57    67      76     82    54          42

13. Calculate total and percentage for all the students.

In [38]:
data = [[50,56,89,40,50,85],
       [84,75,64,58,74,62],
       [55,65,74,80,52,40],
       [12,52,34,15,69,55],
       [25,40,33,10,25,60]]
columns=["Data Science","OOAD","python","Maths","Java","Statistics"]
index = ["Dev","Mahek","Diya","Suraj","Harsh"]
df = pd.DataFrame(data, columns=columns, index=index)
df['Total'] = df.sum(axis=1)
df['Percentage'] = (df['Total'] / len(columns)) * 100
df

       Data Science  OOAD  python  Maths  Java  Statistics  Total   Percentage
Dev              50    56      89     40    50          85    370  6166.666667
Mahek            84    75      64     58    74          62    417  6950.000000
Diya             55    65      74     80    52          40    366  6100.000000
Suraj            12    52      34     15    69          55    237  3950.000000
Harsh            25    40      33     10    25          60    193  3216.666667

14. Calculate Status (PASS / FAIL) for the Students.

In [39]:
df.apply(lambda row: 'PASS' if row['Percentage'] >= 60 else 'FAIL', axis=1)

Dev      PASS
Mahek    PASS
Diya     PASS
Suraj    PASS
Harsh    PASS
dtype: object

15. Calculate percentage based grade value (per>=90 then A-grade, per>=80 then B-grade, per>=70 then C-grade, per>=60 then D-grade, per>=50 then E-grade, per<50 then Fgrade)

In [40]:
df['Percentage'] = df.mean(axis=1)
def get_grade(percentage):
    if percentage >= 90:
        return 'A'
    elif percentage >= 80:
        return 'B'
    elif percentage >= 70:
        return 'C'
    elif percentage >= 60:
        return 'D'
    elif percentage >= 50:
        return 'E'
    else:
        return 'F'
df['Grade'] = df['Percentage'].apply(get_grade)
df

,Data Science,OOAD,python,Maths,Java,Statistics,Total,Percentage,Grade
Dev,50,56,89,40,50,85,370,863.333333,A
Mahek,84,75,64,58,74,62,417,973.000000,A
Diya,55,65,74,80,52,40,366,854.000000,A
Suraj,12,52,34,15,69,55,237,553.000000,A
Harsh,25,40,33,10,25,60,193,450.333333,A

16. Also calculate overall columns total, maximum, minimum and standard deviation for each numeric columns

In [41]:
df = pd.DataFrame(data, columns=columns, index=index)
results = pd.DataFrame({
    'Total': df.sum(),
    'Maximum': df.max(),
    'Minimum': df.min(),
    'Standard Deviation': df.std()
})
results

              Total  Maximum  Minimum  Standard Deviation
Data Science    226       84       12           27.994642
OOAD            288       75       40           13.240091
python          294       89       33           24.752778
Maths           203       80       10           29.356430
Java            270       74       25           19.274335
Statistics      302       85       40           16.226522

17. Display meta-data for each column for the above dataframe.

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Dev to Harsh
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Data Science  5 non-null      int64
 1   OOAD          5 non-null      int64
 2   python        5 non-null      int64
 3   Maths         5 non-null      int64
 4   Java          5 non-null      int64
 5   Statistics    5 non-null      int64
dtypes: int64(6)
memory usage: 280.0+ bytes

18.Convert the above DataFrame to list within a dictionary.

In [43]:
dict_list = df.to_dict(orient='list')
dict_list

{'Data Science': [50, 84, 55, 12, 25],
 'OOAD': [56, 75, 65, 52, 40],
 'python': [89, 64, 74, 34, 33],
 'Maths': [40, 58, 80, 15, 10],
 'Java': [50, 74, 52, 69, 25],
 'Statistics': [85, 62, 40, 55, 60]}

19. Convert this dictionary again to a separate dataframe by adding 500 to each element in product price column.

In [44]:
import pandas as pd

productId = [201, 202, 203, 204, 205]
productName = ['Face Wash', 'Shampo', 'Body Wash', 'Soap', 'Towel']
productPrice = [360, 600, 780, 15, 200]

df = pd.DataFrame({'Product ID': productId, 'Product Name': productName, 'Product Price': productPrice})
df['Product Price'] += 500
df

   Product ID Product Name  Product Price
0         201    Face Wash            860
1         202       Shampo           1100
2         203    Body Wash           1280
3         204         Soap            515
4         205        Towel            700

TASK-2

1. Import pandas as pd

In [3]:
import pandas as pd

2. Read Salaries.csv as a dataframe called sal.

In [4]:
sal = pd.read_csv('Salaries.csv')
sal

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_23136\1798377461.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

3. Check the head of the DataFrame.

In [48]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

4. Use the .info() method to find out how many entries there are.

In [5]:
sal['BasePay'] = pd.to_numeric(sal['BasePay'], errors='coerce')
sal['OvertimePay'] = pd.to_numeric(sal['OvertimePay'], errors='coerce')
sal['OtherPay'] = pd.to_numeric(sal['OtherPay'], errors='coerce')
sal['Benefits'] = pd.to_numeric(sal['Benefits'], errors='coerce')
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

5. What is the average BasePay ?

In [50]:
avg = sal['BasePay'].mean()
avg

66325.4488404877

6. What is the highest amount of OvertimePay in the dataset ?

In [51]:
high_overtimepay = sal['OvertimePay'].max()
high_overtimepay

245131.88

7. What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

In [52]:
joseph_driscoll = sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle'].iloc[0]
joseph_driscoll

'CAPTAIN, FIRE SUPPRESSION'

8. How much does JOSEPH DRISCOLL make (including benefits)?

In [53]:
joseph_salary = sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits'].iloc[0]
joseph_salary

270324.91

9. What is the name of highest paid person (including benefits)?

In [54]:
high_person = sal.loc[sal['TotalPayBenefits'].idxmax()]['EmployeeName']
high_person

'NATHANIEL FORD'

10. What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

In [55]:
low_paid = sal.loc[sal['TotalPayBenefits'].idxmin()]
low_paid['EmployeeName']
low_paid['TotalPayBenefits']

-618.13

11. What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [56]:
average_basepay = sal.groupby('Year')['BasePay'].mean()
average_basepay

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

12. How many unique job titles are there?

In [6]:
unique_job = sal['JobTitle'].nunique()
unique_job

2159

13. What are the top 5 most common jobs?

In [58]:
top5_common_job = sal['JobTitle'].value_counts().head()
top5_common_job

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [60]:
job_title_2013 = sal[sal['Year'] == 2013]['JobTitle'].value_counts()
job_title_2013 = sum(job_title_2013 == 1)
job_title_2013

202

15. How many people have the word Chief in their job title?

In [61]:
chief_title = sum(sal['JobTitle'].apply(lambda x: 'chief' in x.lower()))
chief_title

627

16. Is there a correlation between length of the Job Title string and Salary?

In [62]:
sal['TitleLength'] = sal['JobTitle'].apply(len)
corr = sal[['TitleLength', 'TotalPayBenefits']].corr().iloc[0, 1]
corr

-0.03687844593260901

In [19]:
import pandas as pd
import numpy as np
data = [[123,np.nan,50],
        [456,np.nan,np.nan],
       [np.nan,np.nan]]
df = pd.DataFrame(data,columns=['ProductId','Product Name','Product Price'])
df

   ProductId  Product Name  Product Price
0      123.0           NaN           50.0
1      456.0           NaN            NaN
2        NaN           NaN            NaN

In [21]:
df.isnull()

   ProductId  Product Name  Product Price
0      False          True          False
1      False          True           True
2       True          True           True

In [27]:
df.dropna(thresh=1)

   ProductId  Product Name  Product Price
0      123.0           NaN           50.0
1      456.0           NaN            NaN